[Killed] StringLiteral
src/inject-header.ts:50:41
   // Stryker restore all
 
   const headerKey =
-    request.origin.custom.customHeaders['x-env-header'][0].value;
+    request.origin.custom.customHeaders[""][0].value;
   const headerSecretArn =
     request.origin.custom.customHeaders['x-env-header-secret-arn'][0].value;
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/inject-header.ts:54:33
   const headerSecretArn =
     request.origin.custom.customHeaders['x-env-header-secret-arn'][0].value;
 
-  if (isCacheExpired(cacheTtl)) {
-    validHeaderToken.value = await getLatestSecretValue(headerSecretArn);
-    validHeaderToken.lastUpdated = new Date();
-  }
+  if (isCacheExpired(cacheTtl)) {}
   if (!validHeaderToken.value) {
     throw new Error(`Can't retrieve secret value`);
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Can't retrieve secret value

[Killed] ConditionalExpression
src/inject-header.ts:54:7
   const headerSecretArn =
     request.origin.custom.customHeaders['x-env-header-secret-arn'][0].value;
 
-  if (isCacheExpired(cacheTtl)) {
+  if (false) {
     validHeaderToken.value = await getLatestSecretValue(headerSecretArn);
     validHeaderToken.lastUpdated = new Date();
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Can't retrieve secret value

[Killed] BooleanLiteral
src/inject-header.ts:58:7
     validHeaderToken.value = await getLatestSecretValue(headerSecretArn);
     validHeaderToken.lastUpdated = new Date();
   }
-  if (!validHeaderToken.value) {
+  if (validHeaderToken.value) {
     throw new Error(`Can't retrieve secret value`);
   }
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Can't retrieve secret value

[Killed] ConditionalExpression
src/inject-header.ts:58:7
     validHeaderToken.value = await getLatestSecretValue(headerSecretArn);
     validHeaderToken.lastUpdated = new Date();
   }
-  if (!validHeaderToken.value) {
+  if (false) {
     throw new Error(`Can't retrieve secret value`);
   }
killedBy: inject-header throws an error if the secret value is empty
statusReason: expected 'expect.fail()' to equal 'Can\'t retrieve secret value'

[Killed] StringLiteral
src/inject-header.ts:59:21
     validHeaderToken.lastUpdated = new Date();
   }
   if (!validHeaderToken.value) {
-    throw new Error(`Can't retrieve secret value`);
+    throw new Error(``);
   }
 
killedBy: inject-header throws an error if the secret value is empty
statusReason: expected '' to equal 'Can\'t retrieve secret value'

[Killed] BlockStatement
src/inject-header.ts:72:43
   return request;
 };
 
-function isCacheExpired(cacheTtl: number) {
-  if (!validHeaderToken.value) {
-    return true;
-  }
-  const now = new Date();
-  // lastUpdated is never undefined if value is not empty
-  // eslint-disable-next-line @typescript-eslint/no-non-null-assertion
-  const expires = new Date(validHeaderToken.lastUpdated!.getTime() + cacheTtl);
-  return now >= expires;
-}
+function isCacheExpired(cacheTtl: number) {}
 
 async function getLatestSecretValue(arn: string): Promise<string | undefined> {
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Can't retrieve secret value

[Killed] BooleanLiteral
src/inject-header.ts:73:7
 };
 
 function isCacheExpired(cacheTtl: number) {
-  if (!validHeaderToken.value) {
+  if (validHeaderToken.value) {
     return true;
   }
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] ConditionalExpression
src/inject-header.ts:73:7
 };
 
 function isCacheExpired(cacheTtl: number) {
-  if (!validHeaderToken.value) {
+  if (false) {
     return true;
   }
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] BooleanLiteral
src/inject-header.ts:74:12
 
 function isCacheExpired(cacheTtl: number) {
   if (!validHeaderToken.value) {
-    return true;
+    return false;
   }
   const now = new Date();
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Can't retrieve secret value

[Killed] ArithmeticOperator
src/inject-header.ts:79:28
   const now = new Date();
   // lastUpdated is never undefined if value is not empty
   // eslint-disable-next-line @typescript-eslint/no-non-null-assertion
-  const expires = new Date(validHeaderToken.lastUpdated!.getTime() + cacheTtl);
+  const expires = new Date(validHeaderToken.lastUpdated!.getTime() - cacheTtl);
   return now >= expires;
 }
killedBy: inject-header caches header value
statusReason: expected 2 to equal 1

[Killed] ConditionalExpression
src/inject-header.ts:80:10
   // lastUpdated is never undefined if value is not empty
   // eslint-disable-next-line @typescript-eslint/no-non-null-assertion
   const expires = new Date(validHeaderToken.lastUpdated!.getTime() + cacheTtl);
-  return now >= expires;
+  return false;
 }
 
killedBy: inject-header expires header value cache after 10 minutes by default
statusReason: expected 1 to equal 2

[Killed] ConditionalExpression
src/inject-header.ts:80:10
   // lastUpdated is never undefined if value is not empty
   // eslint-disable-next-line @typescript-eslint/no-non-null-assertion
   const expires = new Date(validHeaderToken.lastUpdated!.getTime() + cacheTtl);
-  return now >= expires;
+  return true;
 }
 
killedBy: inject-header caches header value
statusReason: expected 2 to equal 1

[Killed] BlockStatement
src/inject-header.ts:83:79
   return now >= expires;
 }
 
-async function getLatestSecretValue(arn: string): Promise<string | undefined> {
-  return (
-    await secretClient.send(
-      new GetSecretValueCommand({
-        SecretId: arn,
-      }),
-    )
-  ).SecretString;
-}
+async function getLatestSecretValue(arn: string): Promise<string | undefined> {}
 
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Can't retrieve secret value

[Killed] ObjectLiteral
src/inject-header.ts:86:33
 async function getLatestSecretValue(arn: string): Promise<string | undefined> {
   return (
     await secretClient.send(
-      new GetSecretValueCommand({
-        SecretId: arn,
-      }),
+      new GetSecretValueCommand({}),
     )
   ).SecretString;
killedBy: inject-header injects header with key from `x-env-header` and value from `x-env-header-secret-arn`
statusReason: Cannot read properties of undefined (reading 'SecretString')
