[Killed] BooleanLiteral
src/bootstrap.ts:83:9
       mainConn,
       `SELECT exists(SELECT FROM pg_catalog.pg_database WHERE lower(datname) = lower('${database}'))`,
     );
-    if (!databaseExists) {
+    if (databaseExists) {
       await query(mainConn, `CREATE DATABASE ${database}`);
     }
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(5) ] to include 'CREATE DATABASE app_database'

[Killed] BlockStatement
src/bootstrap.ts:163:24
         adminConn,
         `SELECT exists(SELECT FROM pg_roles WHERE rolname='${cdcUsername}')`,
       );
-      if (!userExists) {
-        await query(
-          adminConn,
-          `CREATE USER ${cdcUsername} WITH ENCRYPTED PASSWORD '${cdcPassword}'`,
-        );
-      } else {
+      if (!userExists) {} else {
       }
     } finally {
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(5) ] to include 'CREATE USER cdc_user WITH ENCRYPTED P…'
