[Killed] BlockStatement
src/verify-header-jwt.ts:31:31
 };
 
 export async function handler(event): Promise<{ isAuthorized: boolean }> {
-  if (event && event.headers) {
-    const [tokenValid, originValid] = await Promise.all([
-      verifyToken(event.headers.authorization),
-      verifyHeader(event.headers[env.HEADER]),
-    ]);
-
-    return { isAuthorized: tokenValid && originValid };
-  }
+  if (event && event.headers) {}
   return { isAuthorized: false };
 }
killedBy: verify-header-jwt should pass happy path
statusReason: expected { isAuthorized: false } to deeply equal { isAuthorized: true }

[Killed] LogicalOperator
src/verify-header-jwt.ts:37:28
       verifyHeader(event.headers[env.HEADER]),
     ]);
 
-    return { isAuthorized: tokenValid && originValid };
+    return { isAuthorized: tokenValid || originValid };
   }
   return { isAuthorized: false };
killedBy: verify-header-jwt should return false for missing header
statusReason: expected { isAuthorized: true } to deeply equal { isAuthorized: false }
