[Killed] BlockStatement
src/client-side-routing.ts:13:60
   }>;
 }
 
-export const handler = async (event: LambdaEdgeRequest) => {
-  const request = event.Records[0].cf.request;
-  if (!path.extname(request.uri)) {
-    request.uri = '/index.html';
-  }
-  return request;
-};
+export const handler = async (event: LambdaEdgeRequest) => {};
 
killedBy: client-side-routing changes the request uri to /index.html when loading an non-asset page
statusReason: Cannot read properties of undefined (reading 'uri')

[Killed] ConditionalExpression
src/client-side-routing.ts:15:7
 
 export const handler = async (event: LambdaEdgeRequest) => {
   const request = event.Records[0].cf.request;
-  if (!path.extname(request.uri)) {
+  if (true) {
     request.uri = '/index.html';
   }
killedBy: client-side-routing does not change request uri when an asset is requested
statusReason: expected '/index.html' to equal '/some-asset.js'

[Killed] BlockStatement
src/client-side-routing.ts:15:35
 
 export const handler = async (event: LambdaEdgeRequest) => {
   const request = event.Records[0].cf.request;
-  if (!path.extname(request.uri)) {
-    request.uri = '/index.html';
-  }
+  if (!path.extname(request.uri)) {}
   return request;
 };
killedBy: client-side-routing changes the request uri to /index.html when loading an non-asset page
statusReason: expected '/home' to equal '/index.html'
