[Killed] ConditionalExpression
src/launch-task.ts:22:11
           assignPublicIp: ecs.AssignPublicIp.DISABLED,
         },
       },
-      ...(env.CONTAINER_NAME && {
-        overrides: {
-          containerOverrides: [
-            {
-              name: env.CONTAINER_NAME,
-              environment: [
-                {
-                  name: 'LAMBDA_EVENT',
-                  value: JSON.stringify(event),
-                },
-              ],
-            },
-          ],
-        },
-      }),
+      ...(true),
     }),
   );
killedBy: Handler - Unit handler should return happy path when CONTAINER_NAME is specified
statusReason: Cannot read properties of undefined (reading 'tasks')

[Killed] LogicalOperator
src/launch-task.ts:22:11
           assignPublicIp: ecs.AssignPublicIp.DISABLED,
         },
       },
-      ...(env.CONTAINER_NAME && {
-        overrides: {
-          containerOverrides: [
-            {
-              name: env.CONTAINER_NAME,
-              environment: [
-                {
-                  name: 'LAMBDA_EVENT',
-                  value: JSON.stringify(event),
-                },
-              ],
-            },
-          ],
-        },
-      }),
+      ...(env.CONTAINER_NAME || {
+  overrides: {
+    containerOverrides: [{
+      name: env.CONTAINER_NAME,
+      environment: [{
+        name: 'LAMBDA_EVENT',
+        value: JSON.stringify(event)
+      }]
+    }]
+  }
+}),
     }),
   );
killedBy: Handler - Unit handler should return happy path when CONTAINER_NAME is specified
statusReason: Cannot read properties of undefined (reading 'tasks')

[Killed] ObjectLiteral
src/launch-task.ts:23:20
         },
       },
       ...(env.CONTAINER_NAME && {
-        overrides: {
-          containerOverrides: [
-            {
-              name: env.CONTAINER_NAME,
-              environment: [
-                {
-                  name: 'LAMBDA_EVENT',
-                  value: JSON.stringify(event),
-                },
-              ],
-            },
-          ],
-        },
+        overrides: {},
       }),
     }),
killedBy: Handler - Unit handler should return happy path when CONTAINER_NAME is specified
statusReason: Cannot read properties of undefined (reading 'tasks')

[Killed] ArrayDeclaration
src/launch-task.ts:24:31
       },
       ...(env.CONTAINER_NAME && {
         overrides: {
-          containerOverrides: [
-            {
-              name: env.CONTAINER_NAME,
-              environment: [
-                {
-                  name: 'LAMBDA_EVENT',
-                  value: JSON.stringify(event),
-                },
-              ],
-            },
-          ],
+          containerOverrides: [],
         },
       }),
killedBy: Handler - Unit handler should return happy path when CONTAINER_NAME is specified
statusReason: Cannot read properties of undefined (reading 'tasks')

[Killed] ObjectLiteral
src/launch-task.ts:25:13
       ...(env.CONTAINER_NAME && {
         overrides: {
           containerOverrides: [
-            {
-              name: env.CONTAINER_NAME,
-              environment: [
-                {
-                  name: 'LAMBDA_EVENT',
-                  value: JSON.stringify(event),
-                },
-              ],
-            },
+            {},
           ],
         },
killedBy: Handler - Unit handler should return happy path when CONTAINER_NAME is specified
statusReason: Cannot read properties of undefined (reading 'tasks')

[Killed] ObjectLiteral
src/launch-task.ts:28:17
             {
               name: env.CONTAINER_NAME,
               environment: [
-                {
-                  name: 'LAMBDA_EVENT',
-                  value: JSON.stringify(event),
-                },
+                {},
               ],
             },
killedBy: Handler - Unit handler should return happy path when CONTAINER_NAME is specified
statusReason: Cannot read properties of undefined (reading 'tasks')
