[Timeout] BlockStatement
src/bootstrap.ts:13:55
 
 const secretClient = new SecretsManagerClient({});
 
-function query(connection: Client, statement: string) {
-  console.log(`[${connection.database}] ${statement}`);
-  return connection.query(statement);
-}
+function query(connection: Client, statement: string) {}
 
 export const handler = async () => {

[Timeout] ObjectLiteral
src/bootstrap.ts:23:35
   const mainSecret = JSON.parse(
     (
       await secretClient.send(
-        new GetSecretValueCommand({
-          SecretId: env.MASTER_USER_SECRET,
-        }),
+        new GetSecretValueCommand({}),
       )
     ).SecretString!,

[Timeout] ObjectLiteral
src/bootstrap.ts:34:35
   const serviceSecret = JSON.parse(
     (
       await secretClient.send(
-        new GetSecretValueCommand({
-          SecretId: env.APP_USER_SECRET,
-        }),
+        new GetSecretValueCommand({}),
       )
     ).SecretString!,

[Timeout] ConditionalExpression
src/bootstrap.ts:43:7
 
   let cdcUserSecret: { username: string; password: string } | undefined;
   // cdc credentials
-  if (env.CDC_USER_SECRET) {
+  if (true) {
     const cdcRaw = (
       await secretClient.send(

[Timeout] BlockStatement
src/bootstrap.ts:43:28
 
   let cdcUserSecret: { username: string; password: string } | undefined;
   // cdc credentials
-  if (env.CDC_USER_SECRET) {
-    const cdcRaw = (
-      await secretClient.send(
-        new GetSecretValueCommand({
-          SecretId: env.CDC_USER_SECRET,
-        }),
-      )
-    ).SecretString;
-
-    if (cdcRaw) cdcUserSecret = JSON.parse(cdcRaw);
-  }
+  if (env.CDC_USER_SECRET) {}
 
   const { username, password } = serviceSecret;

[Killed] ConditionalExpression
src/bootstrap.ts:52:9
       )
     ).SecretString;
 
-    if (cdcRaw) cdcUserSecret = JSON.parse(cdcRaw);
+    if (true) cdcUserSecret = JSON.parse(cdcRaw);
   }
 
killedBy: Handler - Unit handler skips CDC when Secrets Manager returns undefined SecretString
statusReason: "undefined" is not valid JSON

[Killed] ConditionalExpression
src/bootstrap.ts:52:9
       )
     ).SecretString;
 
-    if (cdcRaw) cdcUserSecret = JSON.parse(cdcRaw);
+    if (false) cdcUserSecret = JSON.parse(cdcRaw);
   }
 
killedBy: Handler - Unit handler should complete happy path
statusReason: expected 1 to be at least 2

[Killed] LogicalOperator
src/bootstrap.ts:57:5
 
   const { username, password } = serviceSecret;
   const database =
-    env.APP_DATABASE_NAME ?? serviceSecret.username.replace('_user', '');
+    env.APP_DATABASE_NAME && serviceSecret.username.replace('_user', '');
   const schema = env.APP_SCHEMA_NAME ?? serviceSecret.username;
 
killedBy: Handler - Unit handler should complete happy path
statusReason: expected +0 to be at least 2

[Killed] LogicalOperator
src/bootstrap.ts:58:18
   const { username, password } = serviceSecret;
   const database =
     env.APP_DATABASE_NAME ?? serviceSecret.username.replace('_user', '');
-  const schema = env.APP_SCHEMA_NAME ?? serviceSecret.username;
+  const schema = env.APP_SCHEMA_NAME && serviceSecret.username;
 
   const mainConn = new Client({
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(16) ] to include 'CREATE EXTENSION IF NOT EXISTS pg_trg…'

[Killed] ObjectLiteral
src/bootstrap.ts:60:31
     env.APP_DATABASE_NAME ?? serviceSecret.username.replace('_user', '');
   const schema = env.APP_SCHEMA_NAME ?? serviceSecret.username;
 
-  const mainConn = new Client({
-    user: mainSecret.username,
-    password: mainSecret.password,
-    host: env.RDS_HOST,
-    port: 5432,
-  });
+  const mainConn = new Client({});
 
   const serviceConn = new Client({
killedBy: Handler - Unit handler should complete happy path
statusReason: expected {} to deeply equal { user: 'admin_user', …(3) }

[Killed] BlockStatement
src/bootstrap.ts:76:7
   });
 
   await mainConn.connect();
-  try {
-    const {
-      rows: [{ exists: databaseExists }],
-    } = await query(
-      mainConn,
-      `SELECT exists(SELECT FROM pg_catalog.pg_database WHERE lower(datname) = lower('${database}'))`,
-    );
-    if (!databaseExists) {
-      await query(mainConn, `CREATE DATABASE ${database}`);
-    }
-
-    const {
-      rows: [{ exists: userExists }],
-    } = await query(
-      mainConn,
-      `SELECT exists(SELECT FROM pg_roles WHERE rolname='${username}')`,
-    );
-    if (!userExists) {
-      await query(
-        mainConn,
-        `CREATE USER ${username} WITH ENCRYPTED PASSWORD '${password}'`,
-      );
-    }
-  } finally {
+  try {} finally {
     await mainConn.end();
   }
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(2) ] to include 'SELECT exists(SELECT FROM pg_catalog.…'

[Killed] ConditionalExpression
src/bootstrap.ts:83:9
       mainConn,
       `SELECT exists(SELECT FROM pg_catalog.pg_database WHERE lower(datname) = lower('${database}'))`,
     );
-    if (!databaseExists) {
+    if (false) {
       await query(mainConn, `CREATE DATABASE ${database}`);
     }
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(5) ] to include 'CREATE DATABASE app_database'

[Killed] BlockStatement
src/bootstrap.ts:83:26
       mainConn,
       `SELECT exists(SELECT FROM pg_catalog.pg_database WHERE lower(datname) = lower('${database}'))`,
     );
-    if (!databaseExists) {
-      await query(mainConn, `CREATE DATABASE ${database}`);
-    }
+    if (!databaseExists) {}
 
     const {
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(5) ] to include 'CREATE DATABASE app_database'

[Killed] StringLiteral
src/bootstrap.ts:84:29
       `SELECT exists(SELECT FROM pg_catalog.pg_database WHERE lower(datname) = lower('${database}'))`,
     );
     if (!databaseExists) {
-      await query(mainConn, `CREATE DATABASE ${database}`);
+      await query(mainConn, ``);
     }
 
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(6) ] to include 'CREATE DATABASE app_database'

[Killed] StringLiteral
src/bootstrap.ts:91:7
       rows: [{ exists: userExists }],
     } = await query(
       mainConn,
-      `SELECT exists(SELECT FROM pg_roles WHERE rolname='${username}')`,
+      ``,
     );
     if (!userExists) {
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(6) ] to include 'SELECT exists(SELECT FROM pg_roles WH…'

[Killed] BooleanLiteral
src/bootstrap.ts:93:9
       mainConn,
       `SELECT exists(SELECT FROM pg_roles WHERE rolname='${username}')`,
     );
-    if (!userExists) {
+    if (userExists) {
       await query(
         mainConn,
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(5) ] to include 'CREATE USER myapp_user WITH ENCRYPTED…'

[Killed] ConditionalExpression
src/bootstrap.ts:93:9
       mainConn,
       `SELECT exists(SELECT FROM pg_roles WHERE rolname='${username}')`,
     );
-    if (!userExists) {
+    if (false) {
       await query(
         mainConn,
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(5) ] to include 'CREATE USER myapp_user WITH ENCRYPTED…'

[Killed] BlockStatement
src/bootstrap.ts:99:13
         `CREATE USER ${username} WITH ENCRYPTED PASSWORD '${password}'`,
       );
     }
-  } finally {
-    await mainConn.end();
-  }
+  } finally {}
 
   await serviceConn.connect();
killedBy: Handler - Unit handler should complete happy path
statusReason: expected 1 to be at least 2

[Killed] StringLiteral
src/bootstrap.ts:105:30
 
   await serviceConn.connect();
   try {
-    await query(serviceConn, `CREATE SCHEMA IF NOT EXISTS ${schema}`);
+    await query(serviceConn, ``);
     await query(
       serviceConn,
killedBy: Handler - Unit handler emits the exact CREATE SCHEMA statement (kills string-literal mutant)
statusReason: expected [ '', …(15) ] to not include ''

[Killed] StringLiteral
src/bootstrap.ts:108:7
     await query(serviceConn, `CREATE SCHEMA IF NOT EXISTS ${schema}`);
     await query(
       serviceConn,
-      `CREATE EXTENSION IF NOT EXISTS pg_trgm SCHEMA ${schema} CASCADE`,
+      ``,
     );
     await query(
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(16) ] to include 'CREATE EXTENSION IF NOT EXISTS pg_trg…'

[Killed] StringLiteral
src/bootstrap.ts:112:7
     );
     await query(
       serviceConn,
-      `CREATE EXTENSION IF NOT EXISTS intarray SCHEMA ${schema} CASCADE`,
+      ``,
     );
     await query(
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(16) ] to include 'CREATE EXTENSION IF NOT EXISTS intarr…'

[Killed] StringLiteral
src/bootstrap.ts:116:7
     );
     await query(
       serviceConn,
-      `GRANT CONNECT ON DATABASE ${database} TO ${username}`,
+      ``,
     );
     await query(
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(16) ] to include 'GRANT CONNECT ON DATABASE app_databas…'

[Killed] StringLiteral
src/bootstrap.ts:122:30
       serviceConn,
       `GRANT CREATE ON DATABASE ${database} TO ${username}`,
     );
-    await query(serviceConn, `CREATE SCHEMA IF NOT EXISTS ${schema}`);
+    await query(serviceConn, ``);
     await query(serviceConn, `REVOKE CREATE ON SCHEMA public FROM PUBLIC`);
     await query(serviceConn, `REVOKE ALL ON DATABASE ${database} FROM PUBLIC`);
killedBy: Handler - Unit handler emits the exact CREATE SCHEMA statement (kills string-literal mutant)
statusReason: expected [ …(16) ] to not include ''

[Killed] StringLiteral
src/bootstrap.ts:135:7
     );
     await query(
       serviceConn,
-      `GRANT ALL PRIVILEGES on DATABASE ${database} to ${username}`,
+      ``,
     );
     await query(serviceConn, `ALTER DATABASE ${database} OWNER TO ${username}`);
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(16) ] to include 'GRANT ALL PRIVILEGES on DATABASE app_…'

[Killed] StringLiteral
src/bootstrap.ts:137:30
       serviceConn,
       `GRANT ALL PRIVILEGES on DATABASE ${database} to ${username}`,
     );
-    await query(serviceConn, `ALTER DATABASE ${database} OWNER TO ${username}`);
+    await query(serviceConn, ``);
   } finally {
     await serviceConn.end();
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(16) ] to include 'ALTER DATABASE app_database OWNER TO …'

[Killed] BlockStatement
src/bootstrap.ts:138:13
       `GRANT ALL PRIVILEGES on DATABASE ${database} to ${username}`,
     );
     await query(serviceConn, `ALTER DATABASE ${database} OWNER TO ${username}`);
-  } finally {
-    await serviceConn.end();
-  }
+  } finally {}
 
   // --- CDC user on the cdc existing app database ---
killedBy: Handler - Unit handler should complete happy path
statusReason: expected 1 to be at least 2

[Killed] ConditionalExpression
src/bootstrap.ts:143:7
   }
 
   // --- CDC user on the cdc existing app database ---
-  if (cdcUserSecret) {
+  if (false) {
     const cdcUsername = cdcUserSecret.username;
     const cdcPassword = cdcUserSecret.password;
killedBy: Handler - Unit handler should complete happy path
statusReason: expected 1 to be at least 2

[Killed] ConditionalExpression
src/bootstrap.ts:143:7
   }
 
   // --- CDC user on the cdc existing app database ---
-  if (cdcUserSecret) {
+  if (true) {
     const cdcUsername = cdcUserSecret.username;
     const cdcPassword = cdcUserSecret.password;
killedBy: Handler - Unit handler skips CDC when Secrets Manager returns undefined SecretString
statusReason: Cannot read properties of undefined (reading 'username')

[Killed] ObjectLiteral
src/bootstrap.ts:148:34
     const cdcPassword = cdcUserSecret.password;
 
     // mainConn is already ended above; open a fresh main connection
-    const adminConn = new Client({
-      user: mainSecret.username,
-      password: mainSecret.password,
-      host: env.RDS_HOST,
-      port: 5432,
-    });
+    const adminConn = new Client({});
     await adminConn.connect();
     try {
killedBy: Handler - Unit handler should complete happy path
statusReason: expected {} to deeply equal { user: 'admin_user', …(3) }

[Killed] BlockStatement
src/bootstrap.ts:155:9
       port: 5432,
     });
     await adminConn.connect();
-    try {
-      // Ensure CDC role exists (create/rotate password)
-      const {
-        rows: [{ exists: userExists }],
-      } = await query(
-        adminConn,
-        `SELECT exists(SELECT FROM pg_roles WHERE rolname='${cdcUsername}')`,
-      );
-      if (!userExists) {
-        await query(
-          adminConn,
-          `CREATE USER ${cdcUsername} WITH ENCRYPTED PASSWORD '${cdcPassword}'`,
-        );
-      } else {
-      }
-    } finally {
+    try {} finally {
       await adminConn.end();
     }
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(4) ] to include 'SELECT exists(SELECT FROM pg_roles WH…'

[Killed] ConditionalExpression
src/bootstrap.ts:163:11
         adminConn,
         `SELECT exists(SELECT FROM pg_roles WHERE rolname='${cdcUsername}')`,
       );
-      if (!userExists) {
+      if (true) {
         await query(
           adminConn,
killedBy: Handler - Unit handler handles CDC user already existing without CREATE (else {} branch)
statusReason: expected true to equal false

[Killed] BlockStatement
src/bootstrap.ts:170:15
         );
       } else {
       }
-    } finally {
-      await adminConn.end();
-    }
+    } finally {}
 
     // Minimal DB-level grants for CDC user on the cdc DB
killedBy: Handler - Unit handler should complete happy path
statusReason: expected 1 to be at least 2

[Killed] BlockStatement
src/bootstrap.ts:184:9
     });
 
     await cdcDbConn.connect();
-    try {
-      await query(
-        cdcDbConn,
-        `GRANT CONNECT ON DATABASE ${database} TO ${cdcUsername}`,
-      );
-      await query(
-        cdcDbConn,
-        `GRANT SELECT ON ALL TABLES IN SCHEMA ${schema} TO ${cdcUsername}`,
-      );
-
-      // Grant RDS replication capability (Aurora/RDS-PostgreSQL)
-      await query(
-        cdcDbConn,
-        `GRANT rds_replication, rds_superuser TO ${cdcUsername}`,
-      );
-      await query(
-        cdcDbConn,
-        `CREATE PUBLICATION IF NOT EXISTS cdc_publication FOR ALL TABLES`,
-      );
-    } finally {
+    try {} finally {
       await cdcDbConn.end();
     }
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(12) ] to include 'GRANT CONNECT ON DATABASE app_databas…'

[Killed] StringLiteral
src/bootstrap.ts:187:9
     try {
       await query(
         cdcDbConn,
-        `GRANT CONNECT ON DATABASE ${database} TO ${cdcUsername}`,
+        ``,
       );
       await query(
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(16) ] to include 'GRANT CONNECT ON DATABASE app_databas…'

[Killed] StringLiteral
src/bootstrap.ts:201:9
       );
       await query(
         cdcDbConn,
-        `CREATE PUBLICATION IF NOT EXISTS cdc_publication FOR ALL TABLES`,
+        ``,
       );
     } finally {
killedBy: Handler - Unit handler should complete happy path
statusReason: expected [ …(16) ] to include 'CREATE PUBLICATION IF NOT EXISTS cdc_…'

[Killed] BlockStatement
src/bootstrap.ts:203:15
         cdcDbConn,
         `CREATE PUBLICATION IF NOT EXISTS cdc_publication FOR ALL TABLES`,
       );
-    } finally {
-      await cdcDbConn.end();
-    }
+    } finally {}
     return {
       message: `Database '${database}' for usernames for usernames '${cdcUserSecret.username} & ${serviceSecret.username}' is ready for use!`,
killedBy: Handler - Unit handler should complete happy path
statusReason: expected 1 to be at least 2

[Killed] BlockStatement
src/bootstrap.ts:209:10
     return {
       message: `Database '${database}' for usernames for usernames '${cdcUserSecret.username} & ${serviceSecret.username}' is ready for use!`,
     };
-  } else {
-    return {
-      message: 'CDC_USER_SECRET not set; skipping CDC user/publication setup.',
-    };
-  }
+  } else {}
 };
 
killedBy: Handler - Unit handler skips CDC when Secrets Manager returns undefined SecretString
statusReason: expected undefined to deeply equal { Object (message) }
