[Timeout] BlockStatement
src/verify-header.ts:13:74
 
 let validHeaderToken: string | undefined;
 
-export async function handler(event): Promise<{ isAuthorized: boolean }> {
-  if (event && event.headers) {
-    return { isAuthorized: await verifyHeader(event.headers[env.HEADER]) };
-  }
-  return { isAuthorized: false };
-}
+export async function handler(event): Promise<{ isAuthorized: boolean }> {}
 
 async function verifyHeader(headerValue: string | undefined): Promise<boolean> {

[Timeout] ConditionalExpression
src/verify-header.ts:14:7
 let validHeaderToken: string | undefined;
 
 export async function handler(event): Promise<{ isAuthorized: boolean }> {
-  if (event && event.headers) {
+  if (true) {
     return { isAuthorized: await verifyHeader(event.headers[env.HEADER]) };
   }

[Timeout] BlockStatement
src/verify-header.ts:14:31
 let validHeaderToken: string | undefined;
 
 export async function handler(event): Promise<{ isAuthorized: boolean }> {
-  if (event && event.headers) {
-    return { isAuthorized: await verifyHeader(event.headers[env.HEADER]) };
-  }
+  if (event && event.headers) {}
   return { isAuthorized: false };
 }

[Timeout] BooleanLiteral
src/verify-header.ts:17:26
   if (event && event.headers) {
     return { isAuthorized: await verifyHeader(event.headers[env.HEADER]) };
   }
-  return { isAuthorized: false };
+  return { isAuthorized: true };
 }
 

[Timeout] BlockStatement
src/verify-header.ts:20:80
   return { isAuthorized: false };
 }
 
-async function verifyHeader(headerValue: string | undefined): Promise<boolean> {
-  if (!headerValue) {
-    return false;
-  }
-
-  let verified = headerValue === validHeaderToken;
-  if (!verified) {
-    try {
-      await getLatestSecretValue();
-    } catch (err) {
-      // Just fall through
-    }
-    verified = headerValue === validHeaderToken;
-  }
-
-  return verified;
-}
+async function verifyHeader(headerValue: string | undefined): Promise<boolean> {}
 
 async function getLatestSecretValue(): Promise<void> {

[Timeout] ConditionalExpression
src/verify-header.ts:21:7
 }
 
 async function verifyHeader(headerValue: string | undefined): Promise<boolean> {
-  if (!headerValue) {
+  if (false) {
     return false;
   }

[Timeout] BlockStatement
src/verify-header.ts:21:21
 }
 
 async function verifyHeader(headerValue: string | undefined): Promise<boolean> {
-  if (!headerValue) {
-    return false;
-  }
+  if (!headerValue) {}
 
   let verified = headerValue === validHeaderToken;

[Timeout] BooleanLiteral
src/verify-header.ts:22:12
 
 async function verifyHeader(headerValue: string | undefined): Promise<boolean> {
   if (!headerValue) {
-    return false;
+    return true;
   }
 

[Timeout] EqualityOperator
src/verify-header.ts:25:18
     return false;
   }
 
-  let verified = headerValue === validHeaderToken;
+  let verified = headerValue !== validHeaderToken;
   if (!verified) {
     try {

[Timeout] ConditionalExpression
src/verify-header.ts:25:18
     return false;
   }
 
-  let verified = headerValue === validHeaderToken;
+  let verified = false;
   if (!verified) {
     try {

[Timeout] BooleanLiteral
src/verify-header.ts:26:7
   }
 
   let verified = headerValue === validHeaderToken;
-  if (!verified) {
+  if (verified) {
     try {
       await getLatestSecretValue();

[Timeout] ConditionalExpression
src/verify-header.ts:26:7
   }
 
   let verified = headerValue === validHeaderToken;
-  if (!verified) {
+  if (false) {
     try {
       await getLatestSecretValue();

[Timeout] BlockStatement
src/verify-header.ts:27:9
 
   let verified = headerValue === validHeaderToken;
   if (!verified) {
-    try {
-      await getLatestSecretValue();
-    } catch (err) {
+    try {} catch (err) {
       // Just fall through
     }

[Timeout] ConditionalExpression
src/verify-header.ts:32:16
     } catch (err) {
       // Just fall through
     }
-    verified = headerValue === validHeaderToken;
+    verified = true;
   }
 

[Timeout] EqualityOperator
src/verify-header.ts:32:16
     } catch (err) {
       // Just fall through
     }
-    verified = headerValue === validHeaderToken;
+    verified = headerValue !== validHeaderToken;
   }
 

[Timeout] BlockStatement
src/verify-header.ts:38:54
   return verified;
 }
 
-async function getLatestSecretValue(): Promise<void> {
-  validHeaderToken = (
-    await secretClient.send(
-      new GetSecretValueCommand({
-        SecretId: env.HEADER_SECRET_ARN,
-      }),
-    )
-  ).SecretString;
-}
+async function getLatestSecretValue(): Promise<void> {}
 

[Killed] ObjectLiteral
src/verify-header.ts:41:33
 async function getLatestSecretValue(): Promise<void> {
   validHeaderToken = (
     await secretClient.send(
-      new GetSecretValueCommand({
-        SecretId: env.HEADER_SECRET_ARN,
-      }),
+      new GetSecretValueCommand({}),
     )
   ).SecretString;
killedBy: verify-header should pass happy path
statusReason: expected { isAuthorized: false } to deeply equal { isAuthorized: true }
