[Killed] BooleanLiteral
src/simple-rotate-secret.ts:30:7
   const metadata = await secretClient.send(
     new DescribeSecretCommand({ SecretId: arn }),
   );
-  if (!metadata.RotationEnabled) {
+  if (metadata.RotationEnabled) {
     throw new Error(`Secret ${arn} is not enabled for rotation`);
   }
killedBy: simple-rotate-secret handler Should throw error if rotation not enabled
statusReason: expected '' to equal 'Secret test-arn is not enabled for ro…'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:30:7
   const metadata = await secretClient.send(
     new DescribeSecretCommand({ SecretId: arn }),
   );
-  if (!metadata.RotationEnabled) {
+  if (false) {
     throw new Error(`Secret ${arn} is not enabled for rotation`);
   }
killedBy: simple-rotate-secret handler Should throw error if rotation not enabled
statusReason: expected '' to equal 'Secret test-arn is not enabled for ro…'

[Killed] StringLiteral
src/simple-rotate-secret.ts:31:21
     new DescribeSecretCommand({ SecretId: arn }),
   );
   if (!metadata.RotationEnabled) {
-    throw new Error(`Secret ${arn} is not enabled for rotation`);
+    throw new Error(``);
   }
 
killedBy: simple-rotate-secret handler Should throw error if rotation not enabled
statusReason: expected '' to equal 'Secret test-arn is not enabled for ro…'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:35:7
   }
 
   const versions = metadata.VersionIdsToStages;
-  if (!versions) {
+  if (true) {
     throw new Error(`Unreachable`);
   }
killedBy: simple-rotate-secret handler Should throw error if token not in VersionIdsToStages
statusReason: expected 'Unreachable' to equal 'Secret version token has no stage for…'

[Killed] BooleanLiteral
src/simple-rotate-secret.ts:35:7
   }
 
   const versions = metadata.VersionIdsToStages;
-  if (!versions) {
+  if (versions) {
     throw new Error(`Unreachable`);
   }
killedBy: simple-rotate-secret handler Should throw error if VersionIdsToStages is undefined
statusReason: expected 'Cannot read properties of undefined (…' to equal 'Unreachable'

[Killed] StringLiteral
src/simple-rotate-secret.ts:36:21
 
   const versions = metadata.VersionIdsToStages;
   if (!versions) {
-    throw new Error(`Unreachable`);
+    throw new Error(``);
   }
   if (!versions[token]) {
killedBy: simple-rotate-secret handler Should throw error if VersionIdsToStages is undefined
statusReason: expected '' to equal 'Unreachable'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:38:7
   if (!versions) {
     throw new Error(`Unreachable`);
   }
-  if (!versions[token]) {
+  if (false) {
     throw new Error(
       `Secret version ${token} has no stage for rotation of secret ${arn}`,
killedBy: simple-rotate-secret handler Should throw error if token not in VersionIdsToStages
statusReason: expected 'Cannot read properties of undefined (…' to equal 'Secret version token has no stage for…'

[Killed] BlockStatement
src/simple-rotate-secret.ts:38:25
   if (!versions) {
     throw new Error(`Unreachable`);
   }
-  if (!versions[token]) {
-    throw new Error(
-      `Secret version ${token} has no stage for rotation of secret ${arn}`,
-    );
-  }
+  if (!versions[token]) {}
   if (versions[token].includes('AWSCURRENT')) {
     throw new Error(
killedBy: simple-rotate-secret handler Should throw error if token not in VersionIdsToStages
statusReason: expected 'Cannot read properties of undefined (…' to equal 'Secret version token has no stage for…'

[Killed] StringLiteral
src/simple-rotate-secret.ts:40:7
   }
   if (!versions[token]) {
     throw new Error(
-      `Secret version ${token} has no stage for rotation of secret ${arn}`,
+      ``,
     );
   }
killedBy: simple-rotate-secret handler Should throw error if token not in VersionIdsToStages
statusReason: expected '' to equal 'Secret version token has no stage for…'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:43:7
       `Secret version ${token} has no stage for rotation of secret ${arn}`,
     );
   }
-  if (versions[token].includes('AWSCURRENT')) {
+  if (false) {
     throw new Error(
       `Secret version ${token} already set as AWSCURRENT for secret ${arn}`,
killedBy: simple-rotate-secret handler Should throw error if token has stage AWSCURRENT
statusReason: expected 'Secret version current not set as AWS…' to equal 'Secret version current already set as…'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:43:7
       `Secret version ${token} has no stage for rotation of secret ${arn}`,
     );
   }
-  if (versions[token].includes('AWSCURRENT')) {
+  if (true) {
     throw new Error(
       `Secret version ${token} already set as AWSCURRENT for secret ${arn}`,
killedBy: simple-rotate-secret handler Should throw error if token does not have stage AWSPENDING
statusReason: expected 'Secret version pending already set as…' to equal 'Secret version pending not set as AWS…'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:48:7
       `Secret version ${token} already set as AWSCURRENT for secret ${arn}`,
     );
   }
-  if (!versions[token].includes('AWSPENDING')) {
+  if (true) {
     throw new Error(
       `Secret version ${token} not set as AWSPENDING for rotation of secret ${arn}`,
killedBy: simple-rotate-secret handler Should throw error if unknown step
statusReason: expected 'Secret version pending not set as AWS…' to include 'Invalid step parameter'

[Killed] BlockStatement
src/simple-rotate-secret.ts:48:48
       `Secret version ${token} already set as AWSCURRENT for secret ${arn}`,
     );
   }
-  if (!versions[token].includes('AWSPENDING')) {
-    throw new Error(
-      `Secret version ${token} not set as AWSPENDING for rotation of secret ${arn}`,
-    );
-  }
+  if (!versions[token].includes('AWSPENDING')) {}
 
   if (step === 'createSecret') {
killedBy: simple-rotate-secret handler Should throw error if token does not have stage AWSPENDING
statusReason: expected '' to equal 'Secret version pending not set as AWS…'

[Killed] StringLiteral
src/simple-rotate-secret.ts:50:7
   }
   if (!versions[token].includes('AWSPENDING')) {
     throw new Error(
-      `Secret version ${token} not set as AWSPENDING for rotation of secret ${arn}`,
+      ``,
     );
   }
killedBy: simple-rotate-secret handler Should throw error if token does not have stage AWSPENDING
statusReason: expected '' to equal 'Secret version pending not set as AWS…'

[Killed] BlockStatement
src/simple-rotate-secret.ts:54:32
     );
   }
 
-  if (step === 'createSecret') {
-    await createSecret(arn, token);
-  } else if (step === 'setSecret') {
+  if (step === 'createSecret') {} else if (step === 'setSecret') {
     // intential no-op
   } else if (step === 'testSecret') {
killedBy: simple-rotate-secret createSecret Should skip creating a new secret if already done
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:54:7
     );
   }
 
-  if (step === 'createSecret') {
+  if (false) {
     await createSecret(arn, token);
   } else if (step === 'setSecret') {
killedBy: simple-rotate-secret createSecret Should skip creating a new secret if already done
statusReason: Invalid step parameter

[Killed] EqualityOperator
src/simple-rotate-secret.ts:56:14
 
   if (step === 'createSecret') {
     await createSecret(arn, token);
-  } else if (step === 'setSecret') {
+  } else if (step !== 'setSecret') {
     // intential no-op
   } else if (step === 'testSecret') {
killedBy: simple-rotate-secret handler Should throw error if unknown step
statusReason: expected 'expect.fail()' to include 'Invalid step parameter'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:56:14
 
   if (step === 'createSecret') {
     await createSecret(arn, token);
-  } else if (step === 'setSecret') {
+  } else if (true) {
     // intential no-op
   } else if (step === 'testSecret') {
killedBy: simple-rotate-secret handler Should throw error if unknown step
statusReason: expected 'expect.fail()' to include 'Invalid step parameter'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:58:14
     await createSecret(arn, token);
   } else if (step === 'setSecret') {
     // intential no-op
-  } else if (step === 'testSecret') {
+  } else if (false) {
     // intential no-op
   } else if (step === 'finishSecret') {
killedBy: simple-rotate-secret testSecret should basically do nothing
statusReason: Invalid step parameter

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:58:14
     await createSecret(arn, token);
   } else if (step === 'setSecret') {
     // intential no-op
-  } else if (step === 'testSecret') {
+  } else if (true) {
     // intential no-op
   } else if (step === 'finishSecret') {
killedBy: simple-rotate-secret handler Should throw error if unknown step
statusReason: expected 'expect.fail()' to include 'Invalid step parameter'

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:60:14
     // intential no-op
   } else if (step === 'testSecret') {
     // intential no-op
-  } else if (step === 'finishSecret') {
+  } else if (true) {
     await finishSecret(arn, token, metadata);
   } else {
killedBy: simple-rotate-secret handler Should throw error if unknown step
statusReason: expected '' to include 'Invalid step parameter'

[Killed] BlockStatement
src/simple-rotate-secret.ts:60:39
     // intential no-op
   } else if (step === 'testSecret') {
     // intential no-op
-  } else if (step === 'finishSecret') {
-    await finishSecret(arn, token, metadata);
-  } else {
+  } else if (step === 'finishSecret') {} else {
     throw new Error('Invalid step parameter');
   }
killedBy: simple-rotate-secret finishSecret should update the new secret to AWSCURRENT and remove existing from AWSCURRENT
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/simple-rotate-secret.ts:62:10
     // intential no-op
   } else if (step === 'finishSecret') {
     await finishSecret(arn, token, metadata);
-  } else {
-    throw new Error('Invalid step parameter');
-  }
+  } else {}
 }
 
killedBy: simple-rotate-secret handler Should throw error if unknown step
statusReason: expected 'expect.fail()' to include 'Invalid step parameter'

[Killed] BlockStatement
src/simple-rotate-secret.ts:68:7
 }
 
 async function createSecret(arn: string, token: string) {
-  try {
-    // Skip creating a new password if there already is one for this arn & token
-    await secretClient.send(
-      new GetSecretValueCommand({
-        SecretId: arn,
-        VersionId: token,
-        VersionStage: 'AWSPENDING',
-      }),
-    );
-  } catch (ex) {
+  try {} catch (ex) {
     const password = await secretClient.send(
       new GetRandomPasswordCommand({
killedBy: simple-rotate-secret createSecret Should skip creating a new secret if already done
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/simple-rotate-secret.ts:77:16
         VersionStage: 'AWSPENDING',
       }),
     );
-  } catch (ex) {
-    const password = await secretClient.send(
-      new GetRandomPasswordCommand({
-        PasswordLength: env.SECRET_LENGTH,
-        ExcludeCharacters: env.EXCLUDE_CHARACTERS,
-      }),
-    );
-    await secretClient.send(
-      new PutSecretValueCommand({
-        SecretId: arn,
-        VersionStages: ['AWSPENDING'],
-        SecretString: password.RandomPassword,
-      }),
-    );
-  }
+  } catch (ex) {}
 }
 
killedBy: simple-rotate-secret createSecret Should get a random password and set the secret value
statusReason: expected +0 to equal 1

[Killed] ObjectLiteral
src/simple-rotate-secret.ts:85:33
       }),
     );
     await secretClient.send(
-      new PutSecretValueCommand({
-        SecretId: arn,
-        VersionStages: ['AWSPENDING'],
-        SecretString: password.RandomPassword,
-      }),
+      new PutSecretValueCommand({}),
     );
   }
killedBy: simple-rotate-secret createSecret Should get a random password and set the secret value
statusReason: Error

[Killed] ArrayDeclaration
src/simple-rotate-secret.ts:87:24
     await secretClient.send(
       new PutSecretValueCommand({
         SecretId: arn,
-        VersionStages: ['AWSPENDING'],
+        VersionStages: [],
         SecretString: password.RandomPassword,
       }),
killedBy: simple-rotate-secret createSecret Should get a random password and set the secret value
statusReason: Error

[Killed] BlockStatement
src/simple-rotate-secret.ts:98:3
   arn: string,
   token: string,
   secretMetadata: DescribeSecretCommandOutput,
-) {
-  let currentVersion: string | undefined = undefined;
-
-  for (const version in secretMetadata.VersionIdsToStages) {
-    if (secretMetadata.VersionIdsToStages[version].includes('AWSCURRENT')) {
-      currentVersion = version;
-      break;
-    }
-  }
-  await secretClient.send(
-    new UpdateSecretVersionStageCommand({
-      SecretId: arn,
-      VersionStage: 'AWSCURRENT',
-      MoveToVersionId: token,
-      RemoveFromVersionId: currentVersion,
-    }),
-  );
-}
+) {}
 
killedBy: simple-rotate-secret finishSecret should update the new secret to AWSCURRENT and remove existing from AWSCURRENT
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/simple-rotate-secret.ts:101:60
 ) {
   let currentVersion: string | undefined = undefined;
 
-  for (const version in secretMetadata.VersionIdsToStages) {
-    if (secretMetadata.VersionIdsToStages[version].includes('AWSCURRENT')) {
-      currentVersion = version;
-      break;
-    }
-  }
+  for (const version in secretMetadata.VersionIdsToStages) {}
   await secretClient.send(
     new UpdateSecretVersionStageCommand({
killedBy: simple-rotate-secret finishSecret should update the new secret to AWSCURRENT and remove existing from AWSCURRENT
statusReason: Error

[Killed] BlockStatement
src/simple-rotate-secret.ts:102:76
   let currentVersion: string | undefined = undefined;
 
   for (const version in secretMetadata.VersionIdsToStages) {
-    if (secretMetadata.VersionIdsToStages[version].includes('AWSCURRENT')) {
-      currentVersion = version;
-      break;
-    }
+    if (secretMetadata.VersionIdsToStages[version].includes('AWSCURRENT')) {}
   }
   await secretClient.send(
killedBy: simple-rotate-secret finishSecret should update the new secret to AWSCURRENT and remove existing from AWSCURRENT
statusReason: Error

[Killed] ConditionalExpression
src/simple-rotate-secret.ts:102:9
   let currentVersion: string | undefined = undefined;
 
   for (const version in secretMetadata.VersionIdsToStages) {
-    if (secretMetadata.VersionIdsToStages[version].includes('AWSCURRENT')) {
+    if (true) {
       currentVersion = version;
       break;
killedBy: simple-rotate-secret finishSecret should update the new secret to AWSCURRENT
statusReason: expected +0 to equal 1

[Killed] ObjectLiteral
src/simple-rotate-secret.ts:108:41
     }
   }
   await secretClient.send(
-    new UpdateSecretVersionStageCommand({
-      SecretId: arn,
-      VersionStage: 'AWSCURRENT',
-      MoveToVersionId: token,
-      RemoveFromVersionId: currentVersion,
-    }),
+    new UpdateSecretVersionStageCommand({}),
   );
 }
killedBy: simple-rotate-secret finishSecret should update the new secret to AWSCURRENT and remove existing from AWSCURRENT
statusReason: Error
