[Killed] ObjectLiteral
src/verify-header-jwt.ts:19:42
   jwksUri: `${env.JWT_ISSUER_URL}/jwks.json`,
 });
 
-const verifyOptions: jwt.VerifyOptions = {
-  algorithms: env.JWT_ALGORITHMS,
-  issuer: env.JWT_ISSUER_URL,
-};
+const verifyOptions: jwt.VerifyOptions = {};
 
 const getKey = (header, callback) => {
killedBy: verify-header-jwt should return false for wrong issuer
statusReason: expected { isAuthorized: true } to deeply equal { isAuthorized: false }

[Timeout] BlockStatement
src/verify-header-jwt.ts:24:38
   issuer: env.JWT_ISSUER_URL,
 };
 
-const getKey = (header, callback) => {
-  client.getSigningKey(header.kid, (err, key) => {
-    callback(err, key?.getPublicKey());
-  });
-};
+const getKey = (header, callback) => {};
 
 export async function handler(event): Promise<{ isAuthorized: boolean }> {

[Timeout] BlockStatement
src/verify-header-jwt.ts:25:50
 };
 
 const getKey = (header, callback) => {
-  client.getSigningKey(header.kid, (err, key) => {
-    callback(err, key?.getPublicKey());
-  });
+  client.getSigningKey(header.kid, (err, key) => {});
 };
 

[Killed] OptionalChaining
src/verify-header-jwt.ts:26:19
 
 const getKey = (header, callback) => {
   client.getSigningKey(header.kid, (err, key) => {
-    callback(err, key?.getPublicKey());
+    callback(err, key.getPublicKey());
   });
 };
killedBy: verify-header-jwt should return false for missing key
statusReason: Cannot read properties of undefined (reading 'getPublicKey')

[Timeout] BlockStatement
src/verify-header-jwt.ts:30:74
   });
 };
 
-export async function handler(event): Promise<{ isAuthorized: boolean }> {
-  if (event && event.headers) {
-    const [tokenValid, originValid] = await Promise.all([
-      verifyToken(event.headers.authorization),
-      verifyHeader(event.headers[env.HEADER]),
-    ]);
-
-    return { isAuthorized: tokenValid && originValid };
-  }
-  return { isAuthorized: false };
-}
+export async function handler(event): Promise<{ isAuthorized: boolean }> {}
 
 async function verifyHeader(headerValue: string | undefined): Promise<boolean> {

[Killed] LogicalOperator
src/verify-header-jwt.ts:31:7
 };
 
 export async function handler(event): Promise<{ isAuthorized: boolean }> {
-  if (event && event.headers) {
+  if (event || event.headers) {
     const [tokenValid, originValid] = await Promise.all([
       verifyToken(event.headers.authorization),
killedBy: verify-header-jwt should return false if no event
statusReason: Cannot read properties of undefined (reading 'headers')

[Killed] ConditionalExpression
src/verify-header-jwt.ts:37:28
       verifyHeader(event.headers[env.HEADER]),
     ]);
 
-    return { isAuthorized: tokenValid && originValid };
+    return { isAuthorized: false };
   }
   return { isAuthorized: false };
killedBy: verify-header-jwt should pass happy path
statusReason: expected { isAuthorized: false } to deeply equal { isAuthorized: true }

[Timeout] ConditionalExpression
src/verify-header-jwt.ts:37:28
       verifyHeader(event.headers[env.HEADER]),
     ]);
 
-    return { isAuthorized: tokenValid && originValid };
+    return { isAuthorized: true };
   }
   return { isAuthorized: false };

[Killed] ConditionalExpression
src/verify-header-jwt.ts:47:18
     return false;
   }
 
-  let verified = headerValue === validHeaderToken;
+  let verified = true;
   if (!verified) {
     try {
killedBy: verify-header-jwt should use cached value
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/verify-header-jwt.ts:48:7
   }
 
   let verified = headerValue === validHeaderToken;
-  if (!verified) {
+  if (true) {
     try {
       await getLatestSecretValue();
killedBy: verify-header-jwt should use cached value
statusReason: expected 2 to equal 1

[Killed] BlockStatement
src/verify-header-jwt.ts:48:18
   }
 
   let verified = headerValue === validHeaderToken;
-  if (!verified) {
-    try {
-      await getLatestSecretValue();
-    } catch (err) {
-      // Just fall through
-    }
-    verified = headerValue === validHeaderToken;
-  }
+  if (!verified) {}
 
   return verified;
killedBy: verify-header-jwt should pass happy path
statusReason: expected { isAuthorized: false } to deeply equal { isAuthorized: true }

[Killed] BlockStatement
src/verify-header-jwt.ts:70:78
   ).SecretString;
 }
 
-async function verifyToken(authHeader: string | undefined): Promise<boolean> {
-  const token = authHeader?.split('Bearer ')[1] ?? '';
-
-  return new Promise((resolve) => {
-    jwt.verify(token, getKey, verifyOptions, (err, decoded) => {
-      if (err) {
-        resolve(false);
-      } else {
-        resolve(true);
-      }
-    });
-  });
-}
+async function verifyToken(authHeader: string | undefined): Promise<boolean> {}
 
killedBy: verify-header-jwt should pass happy path
statusReason: expected { isAuthorized: undefined } to deeply equal { isAuthorized: true }

[Killed] LogicalOperator
src/verify-header-jwt.ts:71:17
 }
 
 async function verifyToken(authHeader: string | undefined): Promise<boolean> {
-  const token = authHeader?.split('Bearer ')[1] ?? '';
+  const token = authHeader?.split('Bearer ')[1] && '';
 
   return new Promise((resolve) => {
killedBy: verify-header-jwt should pass happy path
statusReason: expected { isAuthorized: false } to deeply equal { isAuthorized: true }

[Killed] OptionalChaining
src/verify-header-jwt.ts:71:17
 }
 
 async function verifyToken(authHeader: string | undefined): Promise<boolean> {
-  const token = authHeader?.split('Bearer ')[1] ?? '';
+  const token = authHeader.split('Bearer ')[1] ?? '';
 
   return new Promise((resolve) => {
killedBy: verify-header-jwt should return false for missing authorization
statusReason: Cannot read properties of undefined (reading 'split')

[Timeout] BlockStatement
src/verify-header-jwt.ts:73:35
 async function verifyToken(authHeader: string | undefined): Promise<boolean> {
   const token = authHeader?.split('Bearer ')[1] ?? '';
 
-  return new Promise((resolve) => {
-    jwt.verify(token, getKey, verifyOptions, (err, decoded) => {
-      if (err) {
-        resolve(false);
-      } else {
-        resolve(true);
-      }
-    });
-  });
+  return new Promise((resolve) => {});
 }
 

[Timeout] BlockStatement
src/verify-header-jwt.ts:74:64
   const token = authHeader?.split('Bearer ')[1] ?? '';
 
   return new Promise((resolve) => {
-    jwt.verify(token, getKey, verifyOptions, (err, decoded) => {
-      if (err) {
-        resolve(false);
-      } else {
-        resolve(true);
-      }
-    });
+    jwt.verify(token, getKey, verifyOptions, (err, decoded) => {});
   });
 }

[Timeout] ConditionalExpression
src/verify-header-jwt.ts:75:11
 
   return new Promise((resolve) => {
     jwt.verify(token, getKey, verifyOptions, (err, decoded) => {
-      if (err) {
+      if (true) {
         resolve(false);
       } else {

[Timeout] ConditionalExpression
src/verify-header-jwt.ts:75:11
 
   return new Promise((resolve) => {
     jwt.verify(token, getKey, verifyOptions, (err, decoded) => {
-      if (err) {
+      if (false) {
         resolve(false);
       } else {

[Timeout] BooleanLiteral
src/verify-header-jwt.ts:76:17
   return new Promise((resolve) => {
     jwt.verify(token, getKey, verifyOptions, (err, decoded) => {
       if (err) {
-        resolve(false);
+        resolve(true);
       } else {
         resolve(true);

[Timeout] BlockStatement
src/verify-header-jwt.ts:77:14
     jwt.verify(token, getKey, verifyOptions, (err, decoded) => {
       if (err) {
         resolve(false);
-      } else {
-        resolve(true);
-      }
+      } else {}
     });
   });
